% =========================================================
% 多智能体无标签目标围捕 - 仿真初始化参数脚本 (1领航者 + 6跟随者)
% =========================================================
clc;


%% 1. 领航者 (Leader) 初始状态
% 假设在二维平面中运动
p00 = [-7; -2];  % 领航者初始位置 (2x1)
v00 = [0.1; 0.1];  % 领航者初始速度 (2x1)，可结合外部控制输入产生动态轨迹

%% 2. 通信拓扑矩阵 (A_raw) 与 目标可观测性 (beta)
% 采用 6 个跟随者构成的无向环形连通图 (1-2-3-4-5-6-1)
A_raw1 = [0 1 1 0 1 1;
         1 0 1 1 0 1;
         1 1 0 1 0 0;
         0 1 1 0 1 0;
         1 0 0 1 0 1;
         1 1 0 0 1 0];
A_raw2 = [0 1 0 1 0 0;
          1 0 1 1 0 0;
          0 1 0 1 0 0;
          1 1 1 0 0 0
          0 0 0 0 0 0;
          0 0 0 0 0 0];
% beta: 哪些跟随者能直接获取领航者信息 (1表示能，0表示不能)
% 假设只有智能体 1 和 2 能直接观测到领航者的状态
beta1 = [0; 1; 0; 0; 1; 1];beta2 = [0; 1; 1; 0;0;0];%beta2 = [0; 1; 0; 0; 1; 1];

%% 3. 这里可以忽略 无标签编队 不需要 编队偏置向量 (p_off_set) 
% 期望 6 个跟随者在领航者周围形成一个正六边形，设半径 R = 5
R = 10;
% 分别计算 0, 60, 120, 180, 240, 300 度的相对坐标
% 生成的 p_off_set 是一个 2x6 的矩阵，第 i 列对应第 i 个智能体的偏置
p_off_set1 = [R*cos(0) R*cos(pi/3) R*cos(2*pi/3) R*cos(pi) R*cos(4*pi/3) R*cos(5*pi/3);
             R*sin(0) R*sin(pi/3) R*sin(2*pi/3) R*sin(pi) R*sin(4*pi/3) R*sin(5*pi/3)];
p_off_set2 = [R*cos(0) R*cos(pi/2) R*cos(2*pi/2) R*cos(3*pi/2) R*cos(4*pi/3) R*cos(5*pi/3);
              R*sin(0) R*sin(pi/2) R*sin(2*pi/2) R*sin(3*pi/2) R*sin(4*pi/3) R*sin(5*pi/3)];

%% 4. 观测器与导航层初值 (6个跟随者)
% 为了在仿真初始阶段看出明显的收敛过程，故意将它们的初值打散分布在不同位置

% ---- 智能体 1 初值 ----
p_hat_p10 = [-8;  8];   % 领航者位置的观测初值
p_hat_v10 = [ 0;  0];   % 领航者速度的观测初值
p_d_10    = [15;  -20];   % 智能体1自身的期望位置初值

% ---- 智能体 2 初值 ----
p_hat_p20 = [ 8;  5];  
p_hat_v20 = [ 0;  0];   
p_d_20    = [ 25; 0];   

% ---- 智能体 3 初值 ----
p_hat_p30 = [ 5; -5];  
p_hat_v30 = [ 0;  0];   
p_d_30    = [ -25; 10];   

% ---- 智能体 4 初值 ----
p_hat_p40 = [-5; -5];  
p_hat_v40 = [ 0;  0];   
p_d_40    = [-30; 0];   

% ---- 智能体 5 初值 ----
p_hat_p50 = [-8;  0];  
p_hat_v50 = [ 0;  0];   
p_d_50    = [-30; -20];   

% ---- 智能体 6 初值 ----
p_hat_p60 = [ 8;  0];  
p_hat_v60 = [ 0;  0];   
p_d_60    = [ -5; -30];   

% ===== Algorithm switches =====
USE_RESTART    = 1;
USE_SELF_ORDER = 1;
USE_PPC        = 1;
USE_SAT        = 1;
disp('✅ 初始化完毕！所有参数和初值均已加载到 Workspace。请返回 Simulink 点击运行。');